<template>
  <div class="terms">
    <h1>利用規約</h1>
    <p>
      この利用規約（以下，「本規約」とします。）は，ウェブサイト上で提供するサービス（以下，「本サービス」とします。）の利用条件を定めるものです。本サービスの利用者（以下，「ユーザー」とします。）には，本規約に従い，本サービスをご利用いただきます。
    </p>
    <p>
      ユーザーは，本サービスに利用登録することにより，本規約の全ての記載内容について同意したものとみなされます。
    </p>

    <h2>第1条（適用）</h2>
    <p>
      本規約は，ユーザーと本サービス提供者との間の本サービスの利用に関わる一切の関係に適用されるものとします。
    </p>

    <h2>第2条（利用登録）</h2>
    <p>
      本サービスをおいては，登録希望者が本規約に同意の上，TwitterAPIを利用した認証を行うことにより，利用登録が完了するものとします。
    </p>
    <p>
      本サービスの仕様上，ユーザーのTwitterアカウントが非公開アカウントの場合は本サービスの利用はできません。
    </p>

    <h2>第3条（ユーザー情報）</h2>
    <h3>第1項（ユーザー情報の利用目的）</h3>
    <p>
      本サービスは，ユーザーのTwitterアカウントに関して，以下の情報を取得します。
    </p>
    <ol>
      <li>
        TwitterID（ユーザーに一意で付与される数字の羅列のデータ）（例.
        1242379749650907137）
      </li>
      <li>Twitter上の名前（例. Hashlog公式アカウント）</li>
      <li>Twitter上のユーザー名（例. @Hash1og）</li>
      <li>Twitter上のユーザーアイコン</li>
      <li>Twitter上のユーザーのツイート</li>
    </ol>
    <p>
      以上の情報は，本サービスにおけるプロフィール，コンテンツとしての目的でのみ利用する情報であり，その他一切の利用を目的とするものではありません。
    </p>

    <h3>第2項（本サービス内でのユーザー情報取扱について）</h3>
    <p>
      「ハッシュタグを登録する」よりハッシュタグ名を入力することにより，Twitter上のユーザーのツイートデータを収集及び利用し，ユーザーの情報として掲載することに同意するものとします。これ以降，本サービスは自動的に該当のツイートデータをTwitter上から収集します。
    </p>
    <p>
      ユーザーはハッシュタグの登録情報を削除することでのみ，本サービス上からツイートのデータを削除できます。
    </p>
    <p>
      また，本サービス内のユーザー情報及びツイートの変更・削除の行為によってTwitter上のデータに影響を及ぼすことはありません。
    </p>

    <h2>第4条（禁止事項）</h2>
    <p>ユーザーは，本サービスの利用にあたり，以下の行為をしてはなりません。</p>
    <ol>
      <li>法令または公序良俗に違反する行為犯罪行為に関連する行為</li>
      <li>
        本サービスの内容等，本サービスに含まれる著作権，商標権ほか知的財産権を侵害する行為
      </li>
      <li>
        本サービス，ほかのユーザー，またはその他第三者のサーバーまたはネットワークの機能を破壊したり，妨害したりする行為
      </li>
      <li>本サービスによって得られた情報を商業的に利用する行為</li>
      <li>本サービスの運営を妨害するおそれのある行為</li>
      <li>不正アクセスをし，またはこれを試みる行為</li>
      <li>他のユーザーに関する個人情報等を収集または蓄積する行為</li>
      <li>不正な目的を持って本サービスを利用する行為</li>
      <li>
        本サービスの他のユーザーまたはその他の第三者に不利益，損害，不快感を与える行為
      </li>
      <li>他のユーザーに成りすます行為</li>
      <li>
        本サービスが許諾しない本サービス上での宣伝，広告，勧誘，または営業行為，面識のない異性との出会いを目的とした行為
      </li>
      <li>
        本サービスに関連して，反社会的勢力に対して直接または間接に利益を供与する行為
      </li>
      <li>その他，本サービス提供者が不適切と判断する行為</li>
    </ol>

    <h2>第13条（通知及び連絡）</h2>
    <p>
      本サービスからユーザーに対する通知及び連絡は，公式Twitterアカウント（@Hash1og）からユーザーのTwitterアカウントに対するリプライ及びダイレクトメッセージによって行うものとします。
    </p>
    <p>
      また，ユーザーがリマインダーを設定することにより，指定日数を超えてツイートがない場合，公式TwitterアカウントからユーザーのTwitterアカウントに対してリプライを送信することに同意するものとします。これは，ユーザーがリマインダーの設定を変更しない限り継続されます。
    </p>
    <p>
      ユーザーは，Twitter上のユーザー情報に変更があった場合は，遅延なく，本サービスの定める方法により当該変更事項を通知するものとします。
    </p>
    <p>
      本サービス提供者は，現在登録されている連絡先が有効なものとみなして当該連絡先へ通知または連絡を行い，これらは，発信時にユーザーへ到達したものとみなします。
    </p>

    <h2>第5条（本サービスの提供の停止等）</h2>
    <p>
      本サービス提供者は，以下のいずれかの事由があると判断した場合，ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。
    </p>
    <ol>
      <li>本サービスのシステムの保守点検または更新を行う場合</li>
      <li>
        本サービスが利用するインフラサービスの障害などにより，本サービスの提供が困難となった場合
      </li>
      <li>その他，本サービスの提供が困難と判断した場合</li>
    </ol>
    <p>
      本サービスの提供の停止または中断により，ユーザーまたは第三者が被ったいかなる不利益または損害についても，一切の責任を負わないものとします。
    </p>

    <h2>第6条（利用制限および登録抹消）</h2>
    <p>
      本サービス提供者は，ユーザーが以下のいずれかに該当する場合には，事前の通知なく，ユーザーに対して，本サービスの全部もしくは一部の利用を制限し，またはユーザーとしての登録を抹消することができるものとします。
    </p>
    <ol>
      <li>本規約のいずれかの条項に違反した場合</li>
      <li>その他，本サービスの利用を適当でないと判断した場合</li>
    </ol>
    <p>
      本サービス提供者は，本条に基づき行った行為によりユーザーに生じた損害について，一切の責任を負いません。
    </p>

    <h2>第7条（免責事項）</h2>
    <p>
      本サービスの運営者は，本サービスに関して，ユーザーと他のユーザーまたは第三者との間において生じた取引，連絡または紛争等について一切責任を負いません。
    </p>

    <h2>第8条（退会）</h2>
    <p>
      ユーザーは，マイページからユーザー情報を削除することにより，本サービスから退会できるものとします。
    </p>

    <h2>第9条（サービス内容の変更等）</h2>
    <p>
      本サービス提供者は，ユーザーに通知することなく，本サービスの内容を変更または本サービスの提供を中止することができるものとし，これによってユーザーに生じた損害について一切の責任を負いません。
    </p>

    <h2>第10条（利用規約の変更）</h2>
    <p>
      本サービス提供者は，必要と判断した場合には，ユーザーに通知することなくいつでも本規約を変更することができるものとします。なお，本規約の変更後，本サービスの利用を開始した場合には，ユーザーは変更後の規約に同意したものとみなします。
    </p>
  </div>
</template>

<style scoped>
h1 {
  margin-top: 20px;
  margin-bottom: 10px;
}
h2,
h3 {
  margin-top: 15px;
}
.v-application p {
  line-height: 1.7rem;
  margin-top: 0.3rem;
  margin-left: 10px;
  margin-bottom: 0.3rem;
}
ol {
  margin-left: 15px;
}
ol li {
  line-height: 1.7rem;
}
.terms {
  margin-bottom: 20px;
}
</style>
